//------------------------------------------------------------------------------------
// File : saltyAppCPU.h
// Desc : Salty CPU Application.
// Copyright(c) Project Asura. All right reserved.
//------------------------------------------------------------------------------------

#ifndef __SALTY_APP_CPU_H__
#define __SALTY_APP_CPU_H__

//------------------------------------------------------------------------------------
// Includes
//------------------------------------------------------------------------------------
#include <vector>

#include <asdxCamera.h>
#include <asdxRandom.h>

#include <saltyFrameBuffer.h>
#include <saltyShape.h>


namespace salty {

//////////////////////////////////////////////////////////////////////////////////////
// AppCPU class
//////////////////////////////////////////////////////////////////////////////////////
class AppCPU
{
    //================================================================================
    // list of friend classes and methods.
    //================================================================================
    /* NOTHING */

public:
    //================================================================================
    // public variables.
    //================================================================================
    /* NOTHING */

    //================================================================================
    // public methods.
    //================================================================================
    AppCPU();
    virtual ~AppCPU();

    void Run();

protected:
    //================================================================================
    // protected variables.
    //================================================================================
    static const s32        MAX_BOUNCE = 5;
    asdx::Camera            m_Camera;           //!< カメラです.
    asdx::Matrix            m_InvView;          //!< 逆ビュー行列です.
    asdx::Matrix            m_InvViewProj;      //!< 逆ビュー射影行列です.
    FrameBuffer             m_FrameBuffer;      //!< フレームバッファです.
    std::vector<IShape*>    m_ShapeList;        //!< シェイプリストです.
    std::vector<Lambert>    m_LambertList;      //!< ランバートマテリアルのリストです.
    asdx::Random            m_Random;           //!< 乱数発生器です.

    //================================================================================
    // protected methods.
    //================================================================================
    bool            Init        ();
    void            Term        ();
    void            Process     ();
    bool            Intersects  ( const asdx::Ray& ray, HitRecord& record );
    asdx::Vector4   TraceRay    ( const asdx::Ray& ray, s32 numBounce );

private:
    //================================================================================
    // private variables.
    //================================================================================
    /* NOTHING */

    //================================================================================
    // private methods.
    //================================================================================
    /* NOTHING */
};


} // namespace salty

#endif//__SALTY_APP_CPU_H__