//-------------------------------------------------------------------------------------
// File : s2_bmp.h
// Desc : Bitmap Utility Module.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------

#ifndef __S2_BMP_H__
#define __S2_BMP_H__

//----------------------------------------------------------------------------------------
// Includes
//----------------------------------------------------------------------------------------
#include <s2_math.h>


//----------------------------------------------------------------------------------------
//! @brief      BMPファイルに保存します.
//!
//! @param [in]     filename        ファイル名.
//! @param [in]     width           画像の横幅.
//! @param [in]     height          画像の縦幅.
//! @param [in]     pPixel          ピクセル.
//! @retval true    保存に成功.
//! @retval false   保存に失敗.
//----------------------------------------------------------------------------------------
bool SaveToBMP( const char* filename, const int width, const int height, const COLOR* pPixel );


#endif//__S2_BMP_H__