//--------------------------------------------------------------------------------------------
// File : SpriteShader.fx
// Desc : Sprite Shader 
// Copyright(c) Project Asura. All right reserved.
//---------------------------------------------------------------------------------------------

///////////////////////////////////////////////////////////////////////////////////////////////
// VSInput structure
///////////////////////////////////////////////////////////////////////////////////////////////
struct VSInput
{
    float3  Position : POSITION;        //!< 位置座標です.
    float4  Color    : VTXCOLOR;        //!< 頂点カラーです.
    float2  TexCoord : TEXCOORD;        //!< テクスチャ座標です.
};

//////////////////////////////////////////////////////////////////////////////////////////////
// VSOutput structure
//////////////////////////////////////////////////////////////////////////////////////////////
struct VSOutput
{
    float4  Position : SV_POSITION;     //!< 位置座標です.
    float4  Color    : VTXCOLOR;        //!< 頂点カラーです.
    float2  TexCoord : TEXCOORD0;       //!< テクスチャ座標です.
};

//////////////////////////////////////////////////////////////////////////////////////////////
// PSOutput structure
//////////////////////////////////////////////////////////////////////////////////////////////
struct PSOutput
{
    float4  Color    : SV_TARGET0;      //!< カラーです.
};

//////////////////////////////////////////////////////////////////////////////////////////////
// CbPerOnceVS constant buffer
//////////////////////////////////////////////////////////////////////////////////////////////
cbuffer CbPerOnceVS : register( b0 )
{
    float4x4 TransformMtx;   //!< 変換行列です.
};

//-------------------------------------------------------------------------------------------
// Textures
//-------------------------------------------------------------------------------------------
Texture2D<float4>   TextureMap : register( t0 );

//-------------------------------------------------------------------------------------------
// Samplers
//-------------------------------------------------------------------------------------------
SamplerState        TextureSmp : register( s0 );


//-------------------------------------------------------------------------------------------
//! @brief      頂点シェーダメインエントリーポイントです.
//-------------------------------------------------------------------------------------------
VSOutput VSFunc( VSInput input )
{
    VSOutput output = (VSOutput)0;

    // 頂点座標を変換.
    float4 localPos = float4( input.Position, 1.0f );

    // 出力値設定.
    output.Position = mul( TransformMtx, localPos );
    output.Color    = input.Color;
    output.TexCoord = input.TexCoord;

    // ピクセルシェーダに出力.
    return output;
}

//-------------------------------------------------------------------------------------------
//! @brief      ピクセルシェーダメインエントリーポイントです.
//-------------------------------------------------------------------------------------------
PSOutput PSFunc( VSOutput input )
{
    PSOutput output = (PSOutput)0;

    // テクスチャフェッチしたカラーと頂点カラーを乗算.
    output.Color = TextureMap.Sample( TextureSmp, input.TexCoord ) * input.Color;

    // レンダーターゲットに出力.
    return output;
}

