//---------------------------------------------------------------------------
// File : s3d_separator.h
// Desc : Separator Module.
// Copyright(c) Project Asura. All right reserved.
//---------------------------------------------------------------------------

#ifndef __S3D_SEPARATOR_H__
#define __S3D_SEPARATOR_H__

//---------------------------------------------------------------------------
// Includes
//---------------------------------------------------------------------------
#include <s3d_typedef.h>
#include <cassert>


//---------------------------------------------------------------------------
//! @brief      2つのグループに分けます.
//!
//! @param[in,out]  pArray      配列の先頭ポインタ.
//! @param[in]      size        配列のサイズ.
//! @param[in]      func        比較関数.
//! @return     グループの境目の配列インデックスを返却します.
//! @memo       std::partitionを参考にして実装.
//---------------------------------------------------------------------------
template<typename T, class Func>
S3D_INLINE size_t Partition( T* pArray, size_t size, Func func )
{
    size_t first = 0;
    size_t last  = size;
    for( ; ; first++ )
    {
        for( ; first != size && func( pArray[ first ] ); ++first )
        { /* SKIP */ }

        if ( first == last )
            break;

        for( ; first != --last && !func( pArray[ last ] ); )
        { /* SKIP */ }

        if ( first == last )
            break;

        std::swap( pArray[ first ], pArray[ last ] );
    }

    return first;
}


/////////////////////////////////////////////////////////////////////////////
// MortonCodeSeparator class
/////////////////////////////////////////////////////////////////////////////
class MortonCodeSeparator
{
    //=======================================================================
    // list of friend classes and methods.
    //=======================================================================
    /* NOTHING */

public:
    //=======================================================================
    // public variables.
    //=======================================================================
    /* NOTHING */

    //=======================================================================
    // public methods.
    //=======================================================================

    //-----------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //!
    //! @param[in]      offset      先頭からオフセットです(0～29が有効値です).
    //! @param[in]      pCodes      モートンコードの配列です.
    //-----------------------------------------------------------------------
    MortonCodeSeparator( const s32 offset, const u32* pCodes )
    : m_pCodes( pCodes )
    {
        assert( 0 <= offset && offset <= 29 );
        m_Mask = 0x1 << ( 29 - offset ); // 30bitなので0～29が有効値.
    }

    //-----------------------------------------------------------------------
    //! @brief      グループを分けます.
    //-----------------------------------------------------------------------
    S3D_INLINE
    bool operator () ( size_t i ) const
    { return ( m_Mask & m_pCodes[ i ] ) == 0; }

protected:
    //=======================================================================
    // protected variables.
    //=======================================================================
    /* NOTHING */

    //=======================================================================
    // protected methods.
    //=======================================================================
    /* NOTHING */

private:
    //=======================================================================
    // private variables.
    //=======================================================================
    u32         m_Mask;         //!< マスク値です.
    const u32*  m_pCodes;       //!< モートンコード配列の先頭ポインタです.

    //=======================================================================
    // private methods.
    //=======================================================================
    /* NOTHING */
};

#endif//__S3D_PARTITION_H__
