//------------------------------------------------------------------------------------------------
// File : s3d_tonemapper.h
// Desc : Tone Mapper Module.
// Copyright(c) Project Asura. All right reserved.
//------------------------------------------------------------------------------------------------
#pragma once

//------------------------------------------------------------------------------------------------
// Includes
//------------------------------------------------------------------------------------------------
#include <s3d_typedef.h>
#include <s3d_math.h>


namespace s3d {

//------------------------------------------------------------------------------------------------
//! @brief      トーンマッピングを行います.
//!
//! @param[in]      width       画像の横幅です.
//! @param[in]      height      画像の縦幅です.
//! @param[in]      pPixels     ピクセルです.
//! @param[out]     pResult     出力値.
//------------------------------------------------------------------------------------------------
void ToneMapping( const s32 width, const s32 height, const Color* pPixels, Color* pResult );


} // namespace s3d

